Revit 2024 API
DirectContext3DHandleSettings Methods
The DirectContext3DHandleSettings type exposes the following members.
Methods
Name | Description
Assign
 Assigns values of the source settings to this object.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetTransparency
 Gets the transparency value of the handle and the associated DirectContext3D graphics.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsEqual
 Check if the contents of two instances of settings are equal.
SetTransparency
 Sets the transparency value of the handle and the associated DirectContext3D graphics.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
DirectContext3DHandleSettings Class
Autodesk.Revit.DB.DirectContext3D Namespace